
<h4>关于 Def</h4>

<p>Def 是新一代基于虚拟机的开源脚本编程语言，拥有 C 的简捷语法和 Lisp 的强大表现力。</p>

<h6>设计者的理想</h6>

<p>Def 是一个注重简捷与自由的语言，它的设计者混合了他喜欢的语言（C、Python 和 Lisp ） 产生了一种灵活独特的具有元编程特性的新语言。在设计 Def 时遵循两点重要的原则：</p>

<p>　　1. 给予使用者最大的自由<br>

　　2. 尽量减少敲击键盘的次数</p>

<p>Def 并不强迫使用者遵循某种“范式”，或者害怕使用者犯错而设下各种禁区，也未对当前的硬件环境做出设计上的妥协。你只需自由的编写，并得到你想要的结果。</p>

<h6>加入 Def !</h6>

<p>设计和实现语言的标准和内核确实令人激动。但不得不承认，为语言实现完备可用的标准库函数是一项十分浩瀚的工程。如果你对 Def 感兴趣，碰巧也会使用 C++，那么请参与进来吧，一起进行这项充满魅力的创造性工作！</p>

<p>你可以向 <a href="https://github.com/yangjiePro/Def">GitHub</a> 提交新的代码。或者通过下面的联系方式与设计者交流意见和看法。</p>

<h6>联系方式</h6>

<p>　　作者：　杨捷<br>
　　邮箱：　yangjie@jojoin.com<br>
　　QQ ：　446342398<br>
</p>



<br/>
<br/>
<br/>